Model: "hasbullah"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout (Dropout)           multiple                  0         
                                                                 
 gcs_conv (GCSConv)          multiple                  224       
                                                                 
 gcs_conv_1 (GCSConv)        multiple                  2080      
                                                                 
 dense (Dense)               multiple                  1056      
                                                                 
 dense_1 (Dense)             multiple                  2112      
                                                                 
 dense_2 (Dense)             multiple                  8320      
                                                                 
 gcs_conv_2 (GCSConv)        multiple                  16448     
                                                                 
 gcs_conv_3 (GCSConv)        multiple                  8256      
                                                                 
 gcs_conv_4 (GCSConv)        multiple                  8256      
                                                                 
 gcs_conv_5 (GCSConv)        multiple                  8256      
                                                                 
 gcs_conv_6 (GCSConv)        multiple                  8256      
                                                                 
 global_max_pool (GlobalMaxP  multiple                 0         
 ool)                                                            
                                                                 
 global_avg_pool (GlobalAvgP  multiple                 0         
 ool)                                                            
                                                                 
 global_sum_pool (GlobalSumP  multiple                 0 (unused)
 ool)                                                            
                                                                 
 dense_3 (Dense)             multiple                  66048     
                                                                 
 dense_4 (Dense)             multiple                  5130      
                                                                 
=================================================================
Total params: 134,442
Trainable params: 134,442
Non-trainable params: 0
_________________________________________________________________
