Model: "robin"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout_1 (Dropout)         multiple                  0         
                                                                 
 dense_5 (Dense)             multiple                  416       
                                                                 
 dense_6 (Dense)             multiple                  2112      
                                                                 
 dense_7 (Dense)             multiple                  8320      
                                                                 
 gcs_conv_19 (GCSConv)       multiple                  16448     
                                                                 
 gcs_conv_20 (GCSConv)       multiple                  8256      
                                                                 
 gcs_conv_21 (GCSConv)       multiple                  8256      
                                                                 
 gcs_conv_22 (GCSConv)       multiple                  8256      
                                                                 
 gcs_conv_23 (GCSConv)       multiple                  8256      
                                                                 
 global_max_pool_1 (GlobalMa  multiple                 0         
 xPool)                                                          
                                                                 
 global_avg_pool_1 (GlobalAv  multiple                 0         
 gPool)                                                          
                                                                 
 global_sum_pool_1 (GlobalSu  multiple                 0 (unused)
 mPool)                                                          
                                                                 
 dense_8 (Dense)             multiple                  66048     
                                                                 
 dense_9 (Dense)             multiple                  5130      
                                                                 
=================================================================
Total params: 131,498
Trainable params: 131,498
Non-trainable params: 0
_________________________________________________________________
