Model: "hasbullah"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout (Dropout)           multiple                  0         
                                                                 
 gcs_conv (GCSConv)          multiple                  24        
                                                                 
 gcs_conv_1 (GCSConv)        multiple                  136       
                                                                 
 dense (Dense)               multiple                  72        
                                                                 
 dense_1 (Dense)             multiple                  144       
                                                                 
 dense_2 (Dense)             multiple                  544       
                                                                 
 gcs_conv_2 (GCSConv)        multiple                  2080      
                                                                 
 gcs_conv_3 (GCSConv)        multiple                  2080      
                                                                 
 gcs_conv_4 (GCSConv)        multiple                  2080      
                                                                 
 gcs_conv_5 (GCSConv)        multiple                  2080      
                                                                 
 gcs_conv_6 (GCSConv)        multiple                  2080      
                                                                 
 gcs_conv_7 (GCSConv)        multiple                  0 (unused)
                                                                 
 gcs_conv_8 (GCSConv)        multiple                  0 (unused)
                                                                 
 gcs_conv_9 (GCSConv)        multiple                  0 (unused)
                                                                 
 gcs_conv_10 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_11 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_12 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_13 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_14 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_15 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_16 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_17 (GCSConv)       multiple                  0 (unused)
                                                                 
 gcs_conv_18 (GCSConv)       multiple                  0 (unused)
                                                                 
 global_max_pool (GlobalMaxP  multiple                 0         
 ool)                                                            
                                                                 
 global_avg_pool (GlobalAvgP  multiple                 0         
 ool)                                                            
                                                                 
 global_sum_pool (GlobalSumP  multiple                 0 (unused)
 ool)                                                            
                                                                 
 dense_3 (Dense)             multiple                  33280     
                                                                 
 dense_4 (Dense)             multiple                  5130      
                                                                 
=================================================================
Total params: 49,730
Trainable params: 49,730
Non-trainable params: 0
_________________________________________________________________
