Model: "hasbullah"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout (Dropout)           multiple                  0         
                                                                 
 gcs_conv (GCSConv)          multiple                  224       
                                                                 
 gcs_conv_1 (GCSConv)        multiple                  2080      
                                                                 
 dense (Dense)               multiple                  4224      
                                                                 
 dense_1 (Dense)             multiple                  33024     
                                                                 
 dense_2 (Dense)             multiple                  131584    
                                                                 
 gcs_conv_2 (GCSConv)        multiple                  262400    
                                                                 
 gcs_conv_3 (GCSConv)        multiple                  131328    
                                                                 
 gcs_conv_4 (GCSConv)        multiple                  131328    
                                                                 
 gcs_conv_5 (GCSConv)        multiple                  131328    
                                                                 
 gcs_conv_6 (GCSConv)        multiple                  131328    
                                                                 
 global_max_pool (GlobalMaxP  multiple                 0         
 ool)                                                            
                                                                 
 global_avg_pool (GlobalAvgP  multiple                 0         
 ool)                                                            
                                                                 
 global_sum_pool (GlobalSumP  multiple                 0 (unused)
 ool)                                                            
                                                                 
 dense_3 (Dense)             multiple                  262656    
                                                                 
 dense_4 (Dense)             multiple                  4617      
                                                                 
=================================================================
Total params: 1,226,121
Trainable params: 1,226,121
Non-trainable params: 0
_________________________________________________________________
