Model: "hasbullah"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout (Dropout)           multiple                  0         
                                                                 
 gcs_conv (GCSConv)          multiple                  448       
                                                                 
 gcs_conv_1 (GCSConv)        multiple                  8256      
                                                                 
 dense (Dense)               multiple                  16640     
                                                                 
 dense_1 (Dense)             multiple                  131584    
                                                                 
 dense_2 (Dense)             multiple                  525312    
                                                                 
 gcs_conv_2 (GCSConv)        multiple                  1049088   
                                                                 
 gcs_conv_3 (GCSConv)        multiple                  524800    
                                                                 
 gcs_conv_4 (GCSConv)        multiple                  524800    
                                                                 
 gcs_conv_5 (GCSConv)        multiple                  524800    
                                                                 
 gcs_conv_6 (GCSConv)        multiple                  524800    
                                                                 
 global_max_pool (GlobalMaxP  multiple                 0         
 ool)                                                            
                                                                 
 global_avg_pool (GlobalAvgP  multiple                 0         
 ool)                                                            
                                                                 
 global_sum_pool (GlobalSumP  multiple                 0 (unused)
 ool)                                                            
                                                                 
 dense_3 (Dense)             multiple                  524800    
                                                                 
 dense_4 (Dense)             multiple                  4617      
                                                                 
=================================================================
Total params: 4,359,945
Trainable params: 4,359,945
Non-trainable params: 0
_________________________________________________________________
