Model: "robin"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout_1 (Dropout)         multiple                  0         
                                                                 
 dense_5 (Dense)             multiple                  512       
                                                                 
 dense_6 (Dense)             multiple                  33024     
                                                                 
 dense_7 (Dense)             multiple                  131584    
                                                                 
 gcs_conv_20 (GCSConv)       multiple                  262400    
                                                                 
 gcs_conv_21 (GCSConv)       multiple                  131328    
                                                                 
 gcs_conv_22 (GCSConv)       multiple                  131328    
                                                                 
 gcs_conv_23 (GCSConv)       multiple                  131328    
                                                                 
 gcs_conv_24 (GCSConv)       multiple                  131328    
                                                                 
 global_max_pool_1 (GlobalMa  multiple                 0         
 xPool)                                                          
                                                                 
 global_avg_pool_1 (GlobalAv  multiple                 0         
 gPool)                                                          
                                                                 
 global_sum_pool_1 (GlobalSu  multiple                 0 (unused)
 mPool)                                                          
                                                                 
 dense_8 (Dense)             multiple                  262656    
                                                                 
 dense_9 (Dense)             multiple                  4617      
                                                                 
=================================================================
Total params: 1,220,105
Trainable params: 1,220,105
Non-trainable params: 0
_________________________________________________________________
